date:2019/12/23
随便写写，很久没写东西了，公司需要写专利申请书，突然感觉不知道怎么写，从现在开始要锻炼自己的写作能力。
nand flash 分析的相关专利。
这个软件当初带着两个华科实习生做的，目前我一个人继续开发和维护，之前这套软件仅供公司内部使用，现在卖给了客户，所以后面或许会有点麻烦。
前几天给客户开发了一个新命令，这个功能在客户那边暂时表现不错。

之所以使用cpp作为文件后缀，完全是因为格式使用方便，适合换行。并且在集成开发环境里编辑起来比较顺手。

关于游戏
目前在玩王者荣耀，以及王者荣耀里面的自走棋模式（王者模拟战）。王者荣耀段位为钻石二，王者模拟战段位为钻石五。
总觉得玩游戏浪费时间，确实没什么收获，打游戏的时候很好玩，可是之后却觉得太浪费时间了。
归根结底，玩游戏时因为注意力容易集中，所以会获得快乐，实际上做数学题，专心学习，任何事，只要认真都会快乐。
所以有人会说，那些科学家的快乐你想象不到。

然后就要探讨坐车上下班时时间的分配问题。
1.每天上下班过程中拥有1个小时几乎不会中断的时间。
2.过程中可能比较难以集中注意力，考虑需要注意力比较少的事情。
3.所以以娱乐为主，包括看视频，听音乐，打游戏，刷新闻，看小说。（暂时可能不适合做些需要注意力高度集中的事。）
4.但是除了上班，在家的时间很少有不被打扰的，相对来说上班路上确是比较理想的时间。
5.晚上睡觉前时间 > 上下班时间。
6.结论是：可以考虑上下班过程中学习。

date:2019/12/24
在路上思考了一个问题，对于玩电子游戏，看小说，电视上瘾，我们可以把这种上瘾称为软性上瘾。
对抗这种上瘾总有些奇怪的地方，如果现在沉迷于一种游戏，如果开始玩另一种游戏，这有可能对之前沉迷的游戏不感兴趣。
同理，对于小说，电视都有类似之处。
